Revit 2026 API

# RebarShapeHigherEnd Property

---

Defines the higher end of rebar shape.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int HigherEnd { get; }
```
```vb
Public ReadOnly Property HigherEnd As Integer
	Get
```
```cpp
public:
property int HigherEnd {
	int get ();
}
```
```fsharp
member HigherEnd : int with get
```

#### Property Value

Int32

Change this property will make rebar shape's start and end hooks swap.

#### Reference

RebarShape Class

Autodesk.Revit.DB.Structure Namespace